/*Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
6, 1, 33 -> [6, 1, 33]*/

int Readnum(string text);
Console.Write(text);
int number = Int32.Parse(numberstr);
return number;

int num1 = Readnum("Введите число");
int num2 = Readnum("Введите число");
int num3 = Readnum("Введите число");
int num4 = Readnum("Введите число");
int num5 = Readnum("Введите число");
int num6 = Readnum("Введите число");
int num7 = Readnum("Введите число");
int num8 = Readnum("Введите число");

Console.WriteLine($"[{num1}, {num2}, {num3}, {num4}, {num5}, {num6}, {num7}, {num9}]");